Limpieza y mejoras visuales
